<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Description" data-toc-modified-id="Description-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Description</a></span></li><li><span><a href="#Imports" data-toc-modified-id="Imports-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Imports</a></span></li><li><span><a href="#Load-the-database" data-toc-modified-id="Load-the-database-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Load the database</a></span></li><li><span><a href="#Pandas-dataframes" data-toc-modified-id="Pandas-dataframes-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Pandas dataframes</a></span></li><li><span><a href="#Order-Table-is-Corrupted,-Create-new-table" data-toc-modified-id="Order-Table-is-Corrupted,-Create-new-table-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Order Table is Corrupted, Create new table</a></span></li><li><span><a href="#Peek-at-dataframes" data-toc-modified-id="Peek-at-dataframes-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Peek at dataframes</a></span></li><li><span><a href="#PySpark-dataframes" data-toc-modified-id="PySpark-dataframes-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>PySpark dataframes</a></span></li><li><span><a href="#Intermediate-SQL-Questions" data-toc-modified-id="Intermediate-SQL-Questions-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Intermediate SQL Questions</a></span><ul class="toc-item"><li><span><a href="#20.-Categories,-and-the-total-products-in-each-category" data-toc-modified-id="20.-Categories,-and-the-total-products-in-each-category-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>20. Categories, and the total products in each category</a></span></li><li><span><a href="#21.-Total-customers-per-country/city" data-toc-modified-id="21.-Total-customers-per-country/city-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>21. Total customers per country/city</a></span></li><li><span><a href="#22.-Products-that-need-reordering" data-toc-modified-id="22.-Products-that-need-reordering-8.3"><span class="toc-item-num">8.3&nbsp;&nbsp;</span>22. Products that need reordering</a></span></li><li><span><a href="#23.-Products-that-need-reordering,-continued" data-toc-modified-id="23.-Products-that-need-reordering,-continued-8.4"><span class="toc-item-num">8.4&nbsp;&nbsp;</span>23. Products that need reordering, continued</a></span></li><li><span><a href="#24.-Customer-list-by-region" data-toc-modified-id="24.-Customer-list-by-region-8.5"><span class="toc-item-num">8.5&nbsp;&nbsp;</span>24. Customer list by region</a></span></li><li><span><a href="#25.-High-freight-charges" data-toc-modified-id="25.-High-freight-charges-8.6"><span class="toc-item-num">8.6&nbsp;&nbsp;</span>25. High freight charges</a></span></li><li><span><a href="#26.-High-freight-charges---1997" data-toc-modified-id="26.-High-freight-charges---1997-8.7"><span class="toc-item-num">8.7&nbsp;&nbsp;</span>26. High freight charges - 1997</a></span></li><li><span><a href="#27.-High-freight-charges-with-between" data-toc-modified-id="27.-High-freight-charges-with-between-8.8"><span class="toc-item-num">8.8&nbsp;&nbsp;</span>27. High freight charges with between</a></span></li><li><span><a href="#28.-High-freight-charges---last-year" data-toc-modified-id="28.-High-freight-charges---last-year-8.9"><span class="toc-item-num">8.9&nbsp;&nbsp;</span>28. High freight charges - last year</a></span></li><li><span><a href="#29.-Inventory-list" data-toc-modified-id="29.-Inventory-list-8.10"><span class="toc-item-num">8.10&nbsp;&nbsp;</span>29. Inventory list</a></span></li><li><span><a href="#30.-Customers-with-no-orders" data-toc-modified-id="30.-Customers-with-no-orders-8.11"><span class="toc-item-num">8.11&nbsp;&nbsp;</span>30. Customers with no orders</a></span></li><li><span><a href="#31.-Customers-with-no-orders-for-EmployeeID-4" data-toc-modified-id="31.-Customers-with-no-orders-for-EmployeeID-4-8.12"><span class="toc-item-num">8.12&nbsp;&nbsp;</span>31. Customers with no orders for EmployeeID 4</a></span></li></ul></li><li><span><a href="#Time-Taken" data-toc-modified-id="Time-Taken-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Time Taken</a></span></li></ul></div>

# Description
This tutorial is based on the book "SQL Practice Problems"
- [book link](https://www.amazon.com/SQL-Practice-Problems-learn-doing-ebook/dp/B01N41VQFO)
- [Entity Relation](https://docs.yugabyte.com/latest/sample-data/northwind/)

Notes:
- The table Order is corrupt, can not be deleted.
- I will create Orders table from another script.
- The table customercustomerdemo is empty.
- The table CustomerDemographic is empty.
- The Order Table has orderdate between 1996-07-04 to 1998-05-06
  Only the year 1997 has the full year data.   

![](images/northwind_entity_relation.png)

# Imports

In [1]:
import time
time_start_notebook = time.time()

import numpy as np
import pandas as pd

from datetime import datetime
from dateutil.relativedelta import relativedelta
# last_year = datetime.now() - relativedelta(years=1)

import sqlite3
# python module version
sqlite3.version

'2.6.0'

In [2]:
# sqlite database version 
sqlite3.sqlite_version

'3.29.0'

In [3]:
%%javascript
IPython.OutputArea.auto_scroll_threshold = 9999;

In [4]:
# Jupyter notebook settings for pandas
pd.set_option('display.max_columns', 200)
pd.set_option('display.max_rows', 100)

In [5]:
# pyspark
import pyspark
spark = pyspark.sql\
          .SparkSession\
          .builder\
          .appName('bhishan')\
          .getOrCreate()

# sql
from pyspark.sql.functions import col as _col
from pyspark.sql.functions import udf

# @udf("integer") def myfunc(x,y): return x - y
# stddev format_number date_format, dayofyear, when
from pyspark.sql import functions as F
from pyspark.sql.window import Window
from pyspark.sql.functions import (mean as _mean, min as _min,
                                   max as _max, avg as _avg,
                                   when as _when
                                  )

from pyspark.sql.types import *
from pyspark import SparkConf, SparkContext, SQLContext

sc = spark.sparkContext
sqlContext = SQLContext(sc)
# spark_df = sqlContext.createDataFrame(pandas_df)

# Load the database

In [6]:
database = 'data/Northwind.sqlite'

conn = sqlite3.connect(database)
cur = conn.cursor() # cur.exectute(query)

In [7]:
tables = pd.read_sql("""SELECT *
                        FROM sqlite_master
                        WHERE type='table';""", conn)
tables # we see many tables in that database including Country

,type,name,tbl_name,rootpage,sql
0,table,Employee,Employee,2,"CREATE TABLE ""Employee"" \n(\n ""Id"" INTEGER PR..."
1,table,Category,Category,3,"CREATE TABLE ""Category"" \n(\n ""Id"" INTEGER PR..."
2,table,Customer,Customer,4,"CREATE TABLE ""Customer"" \n(\n ""Id"" VARCHAR(80..."
3,table,Shipper,Shipper,8,"CREATE TABLE ""Shipper"" \n(\n ""Id"" INTEGER PRI..."
4,table,Supplier,Supplier,9,"CREATE TABLE ""Supplier"" \n(\n ""Id"" INTEGER PR..."
5,table,Product,Product,12,"CREATE TABLE ""Product"" \n(\n ""Id"" INTEGER PRI..."
6,table,OrderDetail,OrderDetail,14,"CREATE TABLE ""OrderDetail"" \n(\n ""Id"" VARCHAR..."
7,table,CustomerCustomerDemo,CustomerCustomerDemo,16,"CREATE TABLE ""CustomerCustomerDemo"" \n(\n ""Id..."
8,table,CustomerDemographic,CustomerDemographic,18,"CREATE TABLE ""CustomerDemographic"" \n(\n ""Id""..."
9,table,Region,Region,21,"CREATE TABLE ""Region"" \n(\n ""Id"" INTEGER PRIM..."
10,table,Territory,Territory,22,"CREATE TABLE ""Territory"" \n(\n ""Id"" VARCHAR(8..."
11,table,EmployeeTerritory,EmployeeTerritory,24,"CREATE TABLE ""EmployeeTerritory"" \n(\n ""Id"" V..."
12,table,Order,Order,11,"CREATE TABLE ""Order"" (\n""index"" INTEGER,\n ""O..."
13,table,orders,orders,155,CREATE TABLE orders (\n orderid smallint NO...

# Pandas dataframes

In [8]:
tables['name'].to_numpy()

array(['Employee', 'Category', 'Customer', 'Shipper', 'Supplier',
       'Product', 'OrderDetail', 'CustomerCustomerDemo',
       'CustomerDemographic', 'Region', 'Territory', 'EmployeeTerritory',
       'Order', 'orders'], dtype=object)

In [9]:
Employee = pd.read_sql("""SELECT * from Employee""", conn)
Category = pd.read_sql("""SELECT * from Category""", conn)
Customer = pd.read_sql("""SELECT * from Customer""", conn) 
Shipper = pd.read_sql("""SELECT * from Shipper""", conn)
Supplier = pd.read_sql("""SELECT * from Supplier""", conn) 
# Order = pd.read_sql("""SELECT * from Order""", conn)
Product = pd.read_sql("""SELECT * from Product""", conn)
OrderDetail = pd.read_sql("""SELECT * from OrderDetail""", conn)
CustomerCustomerDemo = pd.read_sql("""SELECT * from CustomerCustomerDemo""", conn)
CustomerDemographic = pd.read_sql("""SELECT * from CustomerDemographic""", conn)
Region = pd.read_sql("""SELECT * from Region""", conn)
Territory = pd.read_sql("""SELECT * from Territory""", conn)
EmployeeTerritory = pd.read_sql("""SELECT * from EmployeeTerritory""", conn)

# Order Table is Corrupted, Create new table

In [10]:
cur.execute("drop table if exists Orders")

In [11]:
cur.execute(
"""
CREATE TABLE orders (
    orderid smallint NOT NULL,
    customerid bpchar,
    employeeid smallint,
    orderdate date,
    requireddate date,
    shippeddate date,
    shipvia smallint,
    freight real,
    shipname character varying(40),
    shipaddress character varying(60),
    shipcity character varying(15),
    shipregion character varying(15),
    shippostalcode character varying(10),
    shipcountry character varying(15)
)
""")

In [12]:
!head -n 2 data/orders_data.sql

INSERT INTO orders VALUES (10248, 'VINET', 5, '1996-07-04', '1996-08-01', '1996-07-16', 3, 32.3800011, 'Vins et alcools Chevalier', '59 rue de l''Abbaye', 'Reims', NULL, '51100', 'France');
INSERT INTO orders VALUES (10249, 'TOMSP', 6, '1996-07-05', '1996-08-16', '1996-07-10', 1, 11.6099997, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', NULL, '44087', 'Germany');

In [13]:
with open('data/orders_data.sql') as fi:
    for line in fi.readlines():
        cur.execute(line)
        
conn.commit()

In [14]:
Order = pd.read_sql("""SELECT * from Orders""", conn)
Order.head()

,orderid,customerid,employeeid,orderdate,requireddate,shippeddate,shipvia,freight,shipname,shipaddress,shipcity,shipregion,shippostalcode,shipcountry
0,10248,VINET,5,1996-07-04,1996-08-01,1996-07-16,3,32.380001,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,None,51100,France
1,10249,TOMSP,6,1996-07-05,1996-08-16,1996-07-10,1,11.610000,Toms Spezialitäten,Luisenstr. 48,Münster,None,44087,Germany
2,10250,HANAR,4,1996-07-08,1996-08-05,1996-07-12,2,65.830002,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,RJ,05454-876,Brazil
3,10251,VICTE,3,1996-07-08,1996-08-05,1996-07-15,1,41.340000,Victuailles en stock,"2, rue du Commerce",Lyon,None,69004,France
4,10252,SUPRD,4,1996-07-09,1996-08-06,1996-07-11,2,51.299999,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,None,B-6000,Belgium

In [15]:
Order['orderdate'] = pd.to_datetime(Order['orderdate'])
Order['requireddate'] = pd.to_datetime(Order['requireddate'])
Order['shippeddate'] = pd.to_datetime(Order['shippeddate'])

In [16]:
Order.dtypes

orderid                    int64
customerid                object
employeeid                 int64
orderdate         datetime64[ns]
requireddate      datetime64[ns]
shippeddate       datetime64[ns]
shipvia                    int64
freight                  float64
shipname                  object
shipaddress               object
shipcity                  object
shipregion                object
shippostalcode            object
shipcountry               object
dtype: object

In [17]:
print([ i for i in dir(pyspark.sql.types) if i[0]!='_'])

['ArrayType', 'AtomicType', 'BinaryType', 'BooleanType', 'ByteType', 'CloudPickleSerializer', 'DataType', 'DataTypeSingleton', 'DateConverter', 'DateType', 'DatetimeConverter', 'DecimalType', 'DoubleType', 'FloatType', 'FractionalType', 'IntegerType', 'IntegralType', 'JavaClass', 'LongType', 'MapType', 'NullType', 'NumericType', 'Row', 'ShortType', 'SparkContext', 'StringType', 'StructField', 'StructType', 'TimestampType', 'UserDefinedType', 'array', 'base64', 'basestring', 'calendar', 'ctypes', 'datetime', 'decimal', 'dt', 'from_arrow_schema', 'from_arrow_type', 'json', 'long', 'platform', 're', 'register_input_converter', 'size', 'sys', 'time', 'to_arrow_schema', 'to_arrow_type', 'unicode']

# Peek at dataframes

In [18]:
dfs_names = [ 'Employee', 'Category','Customer',
             'Shipper','Supplier','Order',
             'Product','OrderDetail',
             'CustomerCustomerDemo','CustomerDemographic',
             'Region', 'Territory', 'EmployeeTerritory']

dfs = [ Employee, Category,Customer,Shipper,Supplier,
        Order, Product,OrderDetail,
       CustomerCustomerDemo,CustomerDemographic,
       Region, Territory, EmployeeTerritory]

for df_name, df in zip(dfs_names,dfs):
    print(df_name, df.shape)
    display(df.head(2))

Employee (9, 18)

,Id,LastName,FirstName,Title,TitleOfCourtesy,BirthDate,HireDate,Address,City,Region,PostalCode,Country,HomePhone,Extension,Photo,Notes,ReportsTo,PhotoPath
0,1,Davolio,Nancy,Sales Representative,Ms.,1948-12-08,1992-05-01,507 - 20th Ave. E. Apt. 2A,Seattle,WA,98122,USA,(206) 555-9857,5467,None,Education includes a BA in psychology from Col...,2.0,http://accweb/emmployees/davolio.bmp
1,2,Fuller,Andrew,"Vice President, Sales",Dr.,1952-02-19,1992-08-14,908 W. Capital Way,Tacoma,WA,98401,USA,(206) 555-9482,3457,None,Andrew received his BTS commercial in 1974 and...,NaN,http://accweb/emmployees/fuller.bmp

Category (8, 3)

   Id CategoryName                                        Description
0   1    Beverages        Soft drinks, coffees, teas, beers, and ales
1   2   Condiments  Sweet and savory sauces, relishes, spreads, an...

Customer (91, 11)

,Id,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,None,12209,Germany,030-0074321,030-0076545
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,None,05021,Mexico,(5) 555-4729,(5) 555-3745

Shipper (3, 3)

   Id     CompanyName           Phone
0   1  Speedy Express  (503) 555-9831
1   2  United Package  (503) 555-3199

Supplier (29, 12)

,Id,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax,HomePage
0,1,Exotic Liquids,Charlotte Cooper,Purchasing Manager,49 Gilbert St.,London,None,EC1 4SD,UK,(171) 555-2222,None,None
1,2,New Orleans Cajun Delights,Shelley Burke,Order Administrator,P.O. Box 78934,New Orleans,LA,70117,USA,(100) 555-4822,None,#CAJUN.HTM#

Order (830, 14)

,orderid,customerid,employeeid,orderdate,requireddate,shippeddate,shipvia,freight,shipname,shipaddress,shipcity,shipregion,shippostalcode,shipcountry
0,10248,VINET,5,1996-07-04,1996-08-01,1996-07-16,3,32.380001,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,None,51100,France
1,10249,TOMSP,6,1996-07-05,1996-08-16,1996-07-10,1,11.610000,Toms Spezialitäten,Luisenstr. 48,Münster,None,44087,Germany

Product (77, 10)

,Id,ProductName,SupplierId,CategoryId,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,1,Chai,1,1,10 boxes x 20 bags,18.0,39,0,10,0
1,2,Chang,1,1,24 - 12 oz bottles,19.0,17,40,25,0

OrderDetail (2155, 6)

         Id  OrderId  ProductId  UnitPrice  Quantity  Discount
0  10248/11    10248         11       14.0        12       0.0
1  10248/42    10248         42        9.8        10       0.0

CustomerCustomerDemo (0, 2)

Empty DataFrame
Columns: [Id, CustomerTypeId]
Index: []

CustomerDemographic (0, 2)

Empty DataFrame
Columns: [Id, CustomerDesc]
Index: []

Region (4, 2)

   Id RegionDescription
0   1           Eastern
1   2           Western

Territory (53, 3)

      Id TerritoryDescription  RegionId
0  01581             Westboro         1
1  01730              Bedford         1

EmployeeTerritory (49, 3)

        Id  EmployeeId TerritoryId
0  1/06897           1       06897
1  1/19713           1       19713

# PySpark dataframes

In [19]:
def spark_df_from_pandas(pandas_df):
    df_dtype = pandas_df.dtypes.astype(str).reset_index()
    df_dtype.columns = ['column','dtype']

    mapping = {'int64'  : 'IntegerType()',
               'float64': 'DoubleType()',
               'bool'   : 'BooleanType()',
               'object' : 'StringType()',
               'datetime64[ns]': 'DateType()',
              }

    df_dtype['dtype'] = df_dtype['dtype'].map(mapping)
    df_dtype['schema'] = "    StructField('" +\
                         df_dtype['column'] + "'," +\
                         df_dtype['dtype'] + ",True),"

    head = 'StructType([\n'
    body = '\n'.join(df_dtype['schema'])
    tail = '\n    ])'

    schema = head + body + tail
    spark_df = sqlContext.createDataFrame(pandas_df, eval(schema))
    return spark_df

In [20]:
sEmployee = spark_df_from_pandas(Employee)
sEmployee.createOrReplaceTempView("Employee")

sCategory = spark_df_from_pandas(Category)
sCategory.createOrReplaceTempView("Category")

sCustomer = spark_df_from_pandas(Customer)
sCustomer.createOrReplaceTempView("Customer")

sShipper = spark_df_from_pandas(Shipper)
sShipper.createOrReplaceTempView("Shipper")

sSupplier = spark_df_from_pandas(Supplier)
sSupplier.createOrReplaceTempView("Supplier")

sOrder = spark_df_from_pandas(Order)
sOrder.createOrReplaceTempView("Order")

sProduct = spark_df_from_pandas(Product)
sProduct.createOrReplaceTempView("Product")

sOrderDetail = spark_df_from_pandas(OrderDetail)
sOrderDetail.createOrReplaceTempView("OrderDetail")

sCustomerCustomerDemo = spark_df_from_pandas(CustomerCustomerDemo)
sCustomerCustomerDemo.createOrReplaceTempView("CustomerCustomerDemo")

sCustomerDemographic = spark_df_from_pandas(CustomerDemographic)
sCustomerDemographic.createOrReplaceTempView("CustomerDemographic")

sRegion = spark_df_from_pandas(Region)
sRegion.createOrReplaceTempView("Region")

sTerritory = spark_df_from_pandas(Territory)
sTerritory.createOrReplaceTempView("Territory")

sEmployeeTerritory = spark_df_from_pandas(EmployeeTerritory)
sEmployeeTerritory.createOrReplaceTempView("EmployeeTerritory")

In [21]:
sOrder.createOrReplaceTempView("Orders") # create Orders table.

In [22]:
sOrder.printSchema()

root
 |-- orderid: integer (nullable = true)
 |-- customerid: string (nullable = true)
 |-- employeeid: integer (nullable = true)
 |-- orderdate: date (nullable = true)
 |-- requireddate: date (nullable = true)
 |-- shippeddate: date (nullable = true)
 |-- shipvia: integer (nullable = true)
 |-- freight: double (nullable = true)
 |-- shipname: string (nullable = true)
 |-- shipaddress: string (nullable = true)
 |-- shipcity: string (nullable = true)
 |-- shipregion: string (nullable = true)
 |-- shippostalcode: string (nullable = true)
 |-- shipcountry: string (nullable = true)

In [23]:
# sEmployee.show(2)

In [24]:
# spark.sql('select * from Employee limit 2').show()

# Intermediate SQL Questions

## 20. Categories, and the total products in each category
For this problem, we’d like to see the total number of
products in each category. Sort the results by the total
number of products, in descending order.

In [25]:
Category.head(2)

   Id CategoryName                                        Description
0   1    Beverages        Soft drinks, coffees, teas, beers, and ales
1   2   Condiments  Sweet and savory sauces, relishes, spreads, an...

In [26]:
Product.head(2)

,Id,ProductName,SupplierId,CategoryId,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,1,Chai,1,1,10 boxes x 20 bags,18.0,39,0,10,0
1,2,Chang,1,1,24 - 12 oz bottles,19.0,17,40,25,0

In [27]:
Product[['CategoryId']]\
.merge(Category[['Id','CategoryName']],
       left_on='CategoryId',
       right_on='Id')\
['CategoryName'].value_counts(ascending=False)

Confections       13
Condiments        12
Seafood           12
Beverages         12
Dairy Products    10
Grains/Cereals     7
Meat/Poultry       6
Produce            5
Name: CategoryName, dtype: int64

In [28]:
q = """
select CategoryName, count(CategoryName)
from Product P inner join Category C
on P.CategoryId = C.Id
group by CategoryName
order by count(CategoryName) desc
"""
pd.read_sql(q,conn)

     CategoryName  count(CategoryName)
0     Confections                   13
1       Beverages                   12
2      Condiments                   12
3         Seafood                   12
4  Dairy Products                   10
5  Grains/Cereals                    7
6    Meat/Poultry                    6
7         Produce                    5

In [29]:
# spark.sql(q).show()

In [ ]:
sProduct.select(['CategoryId'])\
.join(sCategory.withColumnRenamed('Id','CategoryId')\
               .select('CategoryId','CategoryName'),
       on='CategoryId')\
.groupby('CategoryName')\
.count()\
.orderBy('count',ascending=False)\
.show()

## 21. Total customers per country/city
In the Customers table, show the total number of
customers per Country and City.

In [ ]:
Customer.head(2)

In [ ]:
Customer.groupby(['Country', 'City'])['Id']\
.count().rename('count').reset_index().head(2)

In [ ]:
q = """
select Country, City, count(*) as count
from Customer
group by Country, City
"""

pd.read_sql(q,conn).head(2)

In [ ]:
sCustomer.groupby(['Country', 'City']).count().show(2)

## 22. Products that need reordering
What products do we have in our inventory that
should be reordered? For now, just use the fields
UnitsInStock and ReorderLevel, where UnitsInStock
is less than the ReorderLevel, ignoring the fields
UnitsOnOrder and Discontinued.
Order the results by ProductID.

In [ ]:
Product.head(2)

In [ ]:
Product[Product.UnitsInStock < Product.ReorderLevel].sort_values('Id')\
[['Id','ProductName','UnitsInStock','ReorderLevel']]

In [ ]:
q = """
select Id, ProductName, UnitsInStock, ReorderLevel
from Product
where UnitsInStock < ReorderLevel
order by Id
"""

# pd.read_sql(q,conn)

In [ ]:
# spark.sql(q).show()

In [ ]:
sProduct[sProduct.UnitsInStock < sProduct.ReorderLevel].orderBy('Id')\
[['Id','ProductName','UnitsInStock','ReorderLevel']]

## 23. Products that need reordering, continued
Now we need to incorporate these fields—
UnitsInStock, UnitsOnOrder, ReorderLevel,
Discontinued—into our calculation. We’ll define
“products that need reordering” with the following:
- UnitsInStock plus UnitsOnOrder are less than
or equal to ReorderLevel
- The Discontinued flag is false (0).

In [ ]:
Product.head(2)

In [ ]:
cond1 = (Product['UnitsInStock'] + Product['UnitsOnOrder']) <= Product['ReorderLevel']

cond2 = Product['Discontinued'] == 0
cond = cond1 & cond2

Product[cond][['UnitsInStock', 'UnitsOnOrder', 'ReorderLevel', 'Discontinued']]

In [ ]:
q = """
select UnitsInStock, UnitsOnOrder, ReorderLevel, Discontinued
from Product
where (UnitsInStock + UnitsOnOrder) <= ReorderLevel
    and Discontinued = 0
"""

pd.read_sql(q,conn)

In [ ]:
cond1 = (sProduct['UnitsInStock'] + 
         sProduct['UnitsOnOrder']
        ) <= sProduct['ReorderLevel']

cond2 = sProduct['Discontinued'] == 0
cond = cond1 & cond2

sProduct[cond][['UnitsInStock', 'UnitsOnOrder',
                'ReorderLevel', 'Discontinued']].show()

## 24. Customer list by region
A salesperson for Northwind is going on a business
trip to visit customers, and would like to see a list of
all customers, sorted by region, alphabetically.
However, he wants the customers with no region
(null in the Region field) to be at the end, instead of
at the top, where you’d normally find the null values.
Within the same region, companies should be sorted
by CustomerID.

In [ ]:
Customer.head(2)

In [ ]:
Customer[['Id','CompanyName','Region']].sort_values(['Region','Id']).head(4)

In [ ]:
q = """
-- Note: we need two same columns.
select Id, CompanyName, Region
from Customer

order by

region is null, region, id 
-- case when Region is null then 1 else 0 end asc, region asc,  Id asc
"""
pd.read_sql(q,conn).head(2)

In [ ]:
sCustomer.select('Id', 'CompanyName', 'Region').orderBy(
    sCustomer.Region.asc_nulls_last(), 'Id').show(3)

## 25. High freight charges
Some of the countries we ship to have very high
freight charges. We'd like to investigate some more
shipping options for our customers, to be able to
offer them lower freight charges. Return the three
ship countries with the highest average freight
overall, in descending order by average freight.

In [ ]:
Order.head(2)

In [ ]:
# good
Order.groupby('shipcountry')['freight'].mean().rename('avg_freight').nlargest(3).reset_index()

In [ ]:
# good (Named Aggregation pandas 1.0)
Order.groupby('shipcountry').agg(
    avg_freight = ('freight','mean')
).nlargest(3,'avg_freight')

In [ ]:
# bad
Order.groupby('shipcountry')['freight'].mean().sort_values(ascending=False).head(3)

In [ ]:
q = """select * from Orders limit 2"""
pd.read_sql(q,conn)

In [ ]:
# checking
q = """
select shipcountry, avg(freight)

from Orders
group by shipcountry
"""

pd.read_sql(q,conn).style.highlight_max()

In [ ]:
q = """
select shipcountry, avg(freight)
from Orders
group by shipcountry
order by avg(freight) desc
limit 3
"""
pd.read_sql(q,conn)

In [ ]:
sOrder.groupby('shipcountry')\
.agg({'freight':'avg'})\
.orderBy('avg(freight)',ascending=False)\
.limit(3)\
.show()

In [ ]:
spark.sql(q.replace('Orders','Order')).show()

## 26. High freight charges - 1997
We're continuing on the question above on high
freight charges. Now, instead of using all the orders
we have, we only want to see orders from the year
1997.

In [ ]:
Order.head(2)

In [ ]:
Order['orderdate'] = pd.to_datetime(Order['orderdate'])
Order['requireddate'] = pd.to_datetime(Order['requireddate'])
Order['shippeddate'] = pd.to_datetime(Order['shippeddate'])

Order.head(2)

In [ ]:
Order.orderdate.apply([min,max])

In [ ]:
# I have altered data for Order so I will take 1997 instead of 2015.

In [ ]:
Order[Order.orderdate >= '1997-01-01'].head(2)

In [ ]:
df1 = Order[Order.orderdate.between('1997-01-01','1998-01-01')]
df1.head(2).append(df1.tail(2))
# between is both inclusive

In [ ]:
df1 = Order[ (Order.orderdate >= '1997-01-01') &
             (Order.orderdate < '1998-01-01')]
df1.head(2).append(df1.tail(2))

In [ ]:
df1.groupby('shipcountry')[['freight']].mean().sort_values('freight',ascending=False)

In [ ]:
Order[ (Order.orderdate >= '1997-01-01') &
       (Order.orderdate < '1998-01-01')]\
.groupby('shipcountry')\
.agg(avg_freight = ('freight','mean')
).nlargest(3,'avg_freight')

In [ ]:
q = """
select * from Orders
where orderdate between '1997-01-01' and '1998-01-01'
limit 3

"""

pd.read_sql(q,conn)

In [ ]:
# without casting as date
# between is both end inclusive.
q = """
select shipcountry, avg(freight)
from Orders
where orderdate between '1997-01-01' and '1997-12-31'
group by shipcountry
order by avg(freight) desc
limit 3
"""

pd.read_sql(q,conn)

In [ ]:
# using date
q = """
select shipcountry, avg(freight)

from Orders

where    cast(orderdate as date) >= cast('1997-01-01' as date)
    and  cast(orderdate as date) <  cast('1998-01-01' as date)

group by shipcountry
order by avg(freight) desc
limit 3
"""

pd.read_sql(q,conn)

In [ ]:
sOrder\
[ (sOrder.orderdate >= '1997-01-01') &
  (sOrder.orderdate < '1998-01-01')]\
.groupby('shipcountry')\
.agg({'freight':'avg'})\
.orderBy('avg(freight)',ascending=False)\
.limit(3)\
.show()

## 27. High freight charges with between

In [ ]:
# This question simply asks not to use 'between' operator since 
# it is both inclusive.

## 28. High freight charges - last year
We're continuing to work on high freight charges.
We now want to get the three ship countries with the
highest average freight charges. But instead of
filtering for a particular year, we want to use the last
12 months of order data, using as the end date the last
OrderDate in Orders.

In [ ]:
# we only care sorted data last 12 months.

In [ ]:
Order.head(2)

In [ ]:
Order.orderdate.max()

In [ ]:
Order.orderdate.max() - pd.Timedelta('12 M') # 12 minutes before

In [ ]:
Order.orderdate.max() - np.timedelta64(12,'M')

In [ ]:
Order.orderdate.max() - pd.DateOffset(months=12)

In [ ]:
pd.to_datetime('2020-12-31') - pd.DateOffset(months=12)

In [ ]:
cond1 = Order.orderdate <= Order.orderdate.max()
cond2 = Order.orderdate > (Order.orderdate.max() -
                           pd.DateOffset(months=12))
cond = cond1 & cond2

df1 = Order[cond]
df1.head(2)

In [ ]:
# Order[Order.orderdate == Order.orderdate.max()].head(2)

In [ ]:
Order[cond]\
.groupby('shipcountry')\
.agg(avg_freight = ('freight','mean')
).nlargest(3,'avg_freight')

In [ ]:
q = """
select 

date(orderdate )
from Orders
limit 3
"""

pd.read_sql(q,conn)

In [ ]:
q = """
select 
date(orderdate , '-12 month')
from Orders
limit 3
"""

pd.read_sql(q,conn)

In [ ]:
q = """
select 
max(orderdate)
from Orders
limit 3
"""

pd.read_sql(q,conn)

In [ ]:
Order.orderdate.max()

In [ ]:
q = """
select 
date(max(orderdate), '-12 month')
from Orders
limit 3
"""

pd.read_sql(q,conn)

In [ ]:
q = """
select shipcountry, round(avg(freight),2)

from Orders

where date(orderdate) >= 
  (
    select 
    date(max(orderdate),
    '-12 month')
    from Orders
   )

and  date(orderdate) <  
    (
    select 
    date(max(orderdate))
    from Orders
    )

group by shipcountry
order by avg(freight) desc
limit 3
"""

pd.read_sql(q,conn)

In [ ]:
sdf = sOrder[['orderdate','shipcountry','freight']]
sdf.show(2)

In [ ]:
orderdate_max = sOrder.agg({'orderdate':'max'}).collect()[0][0]

orderdate_max

In [ ]:
from datetime import datetime
from dateutil.relativedelta import relativedelta

last_year = orderdate_max - relativedelta(years=1)
last_year

In [ ]:
orderdate_max = sOrder.agg({'orderdate':'max'}).collect()[0][0]
last_year = orderdate_max - relativedelta(years=1)

cond1 = sOrder.orderdate <= orderdate_max
cond2 = sOrder.orderdate > last_year
cond = cond1 & cond2

sOrder[cond]\
.groupby('shipcountry')\
.agg({'freight':'avg'})\
.orderBy('avg(freight)',ascending=False)\
.withColumn('avg_freight', F.round(F.col('avg(freight)'),2))\
.drop('avg(freight)')\
.limit(3)\
.show()

In [ ]:
# spark.sql(q).show() # this does not work because of function date.

## 29. Inventory list
We're doing inventory, and need to show information
like the below, for all orders. Sort by OrderID and
Product ID.

Expected Results:

`EmployeeID LastName OrderID ProductName Quantity`

Look at the entity relation:
![](images/northwind_entity_relation.png)

In [ ]:
# from ER diagram, we see we need to join 4 tables:
# products order_detals, orders, employees.

In [ ]:
Product.head(2)

In [ ]:
OrderDetail.head(2)

In [ ]:
Order.head(2)

In [ ]:
Employee.head(2)

In [ ]:
p_od = (Product[['Id','ProductName']]\
    .rename(columns={'Id': 'ProductId'})
.join(
    OrderDetail[['OrderId','ProductId','Quantity']]
    ,on='ProductId',lsuffix='',rsuffix='_od'
    ).drop('ProductId_od',axis=1)
)

p_od.head(2)

In [ ]:
Order[['orderid','employeeid']]\
.rename(columns={'orderid':'OrderID',
                 'employeeid':'EmployeeID'})\
.head(2)

In [ ]:
p_od_o = p_od.join(
Order[['orderid','employeeid']]\
.rename(columns={'orderid':'OrderID',
                 'employeeid':'EmployeeID'}))

p_od_o.head(2)

In [ ]:
Employee[['Id','LastName']]\
.rename(columns={'Id':'EmployeeID'})\
.head(2)

In [ ]:
p_od_o_e = p_od_o.join(
Employee[['Id','LastName']]\
.rename(columns={'Id':'EmployeeID'}),
on='EmployeeID',lsuffix='',rsuffix='_emp'
)\
.sort_values(['OrderID','ProductId'])\
[['EmployeeID','LastName','OrderID','ProductName','Quantity']]

p_od_o_e.head(2)

In [ ]:
q = """
-- look at different tables and write id of table below:
select * from Orders limit 1
"""

pd.read_sql(q,conn)

In [ ]:
"""
Product.Id
OrderDetail.orderid productid
Orders orderid employeeid quantity
Employee.Id LastName
""";

In [ ]:
q = """
select e.id as EmployeeId, e.lastname,
       o.orderid as OrderId, p.productname, od.quantity

from Product p 
join OrderDetail od on od.productid = p.id
join Orders o on o.orderid = od.orderid
join Employee e on e.id = o.employeeid

order by o.orderid, od.productid

limit 3
"""

pd.read_sql(q,conn)

In [ ]:
spark.sql(q).show()

## 30. Customers with no orders
There are some customers who have never actually
placed an order. Show these customers.

In [ ]:
Customer.head(2)

In [ ]:
Order.head(2)

In [ ]:
np.setdiff1d(Customer['Id'], Order['customerid'])

In [ ]:
set(Customer['Id']).difference(Order['customerid'])

In [ ]:
q = """
select * from Orders limit 1
"""
pd.read_sql(q,conn)

In [ ]:
# Customer Id 
# Orders customerid

In [ ]:
q = """
-- We need left join (default is inner join)
select c.id, o.customerid
from Customer c
left join Orders o on o.customerid = c.id
where o.customerid is null
"""

pd.read_sql(q,conn)

## 31. Customers with no orders for EmployeeID 4
One employee (Margaret Peacock, EmployeeID 4)
has placed the most orders. However, there are some
customers who've never placed an order with her.
Show only those customers who have never placed
an order with her.

In [ ]:
Order.head(2)
# NOTE: order table has column customerid but these are not
# all the customers, all the ids of customers are in table Customer.

In [ ]:
Order.shape

In [ ]:
Order.employeeid.value_counts().head(2)

In [ ]:
Employee[Employee.Id==4].head(2)

In [ ]:
Customer.head(2)

In [ ]:
np.setdiff1d(Customer['Id'],
             Order.loc[Order.employeeid==4, 'customerid']) # .shape

In [ ]:
q = """
select * from Orders limit 2
"""
pd.read_sql(q,conn)

In [ ]:
# Customer:  Id 
# Orders: customerid employeeid

In [ ]:
q = """
select c.Id, o.customerid
from Customer c
left join Orders o on (o.customerid = c.id
                      and o.employeeid = 4)
where o.customerid is null
"""
pd.read_sql(q,conn)

In [ ]:
spark.sql(q).show()

In [ ]:
sCustomer[['Id']].show(2)

In [ ]:
sOrder[sOrder.employeeid==4].select('customerid').show(2)

In [ ]:
sCustomer.select('Id').subtract(
sOrder[sOrder.employeeid==4].select('customerid')
).show()

# Time Taken

In [ ]:
time_taken = time.time() - time_start_notebook
h,m = divmod(time_taken,60*60)
print('Time taken: {:.0f} hr {:.0f} min {:.0f} secs'.format(h, *divmod(m,60)))